#+TITLE: Metoda quasi-Newtona DFP
#+SUBTITLE: Optymalizacja nieliniowa - projekt 2
#+AUTHOR: Patryk Gronkiewicz 164157
#+LANGUAGE: pl
#+OPTIONS: toc:nil H:2 num:t
#+PROPERTY: header-args:R  :session *R* :eval never-export
#+BEAMER_THEME: Hannover
#+BEAMER_COLOR_THEME: orchid
#+BEAMER_FONT_THEME: professionalfonts
#+STARTUP: beamer latexpreview
#+EXCLUDE_TAGS: noexport

** Funkcja "podstawowa"
Dla funkcji, którą zdefiniowaliśmy wcześniej
#+name: test_base
#+begin_src R :exports both
dfp(f, c(1,1), 1e-6)
#+end_src

#+RESULTS:
| 0.475814583132696 |
| 0.474830972086607 |

Zbiega się ona w zaledwie 15 iteracjach.
** Funkcja testująca
Dodatkowo sprawdzimy wyniki dla funkcji Beale'a, która ma minimum dla $f(3, 0.5)=0$.
#+name: test_beale
#+begin_src R :exports both
beale <- function(x) {
  el1 <- (1.5-x[1]+x[1]*x[2])^2
  el2 <- (2.25-x[1]+x[1]*x[2]^2)^2
  el3 <- (2.625-x[1]+x[1]*x[2]^3)^2
  return(el1+el2+el3)
}
dfp(beale, c(1,1), 1e-6)
#+end_src

#+RESULTS:
|  2.99996324899107 |
| 0.499991321090635 |

Tej funkcji ,,zbiegnięcie się'' zajmuje dużo dłużej, jednak jest ono osiągnięte - po 415 iteracjach.

